12/data/attachments/83ac7b92dec45ba5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Ryan_no_Friend_67821_5</nif:username>
            <nif:friendToBeRequested>soap_friends_408bef4b-ea0f-4869-9202-5823b89f5637</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>